Revit 2027 API
LoadCombination.Type Property
 The type of the load combination.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LoadCombinationType Type { get; set; }
Public Property Type As LoadCombinationType
	Get
	Set
public:
property LoadCombinationType Type {
	LoadCombinationType get ();
	void set (LoadCombinationType value);
}
member Type : LoadCombinationType with get, set
Property Value
LoadCombinationType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
LoadCombination Class
Autodesk.Revit.DB.Structure Namespace